CSI API ETABS v1
cAnalyze.GetDesignResponseOption Method
 Retrieves the design and response recovery options.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignResponseOption(
	ref int NumberDesignThreads,
	ref int NumberResponseRecoveryThreads,
	ref int UseMemoryMappedFilesForResponseRecovery,
	ref bool ModelDifferencesOKWhenMergingResults
)
Function GetDesignResponseOption (
	ByRef NumberDesignThreads As Integer,
	ByRef NumberResponseRecoveryThreads As Integer,
	ByRef UseMemoryMappedFilesForResponseRecovery As Integer,
	ByRef ModelDifferencesOKWhenMergingResults As Boolean
) As Integer
Dim instance As cAnalyze
Dim NumberDesignThreads As Integer
Dim NumberResponseRecoveryThreads As Integer
Dim UseMemoryMappedFilesForResponseRecovery As Integer
Dim ModelDifferencesOKWhenMergingResults As Boolean
Dim returnValue As Integer
returnValue = instance.GetDesignResponseOption(NumberDesignThreads,
	NumberResponseRecoveryThreads,
	UseMemoryMappedFilesForResponseRecovery,
	ModelDifferencesOKWhenMergingResults)
int GetDesignResponseOption(
	int% NumberDesignThreads,
	int% NumberResponseRecoveryThreads,
	int% UseMemoryMappedFilesForResponseRecovery,
	bool% ModelDifferencesOKWhenMergingResults
)
abstract GetDesignResponseOption :
        NumberDesignThreads : int byref *
        NumberResponseRecoveryThreads : int byref *
        UseMemoryMappedFilesForResponseRecovery : int byref *
        ModelDifferencesOKWhenMergingResults : bool byref -> int
Parameters
NumberDesignThreads
Type: System.Int32
 Number of threads that design can use. Positive if user specified, negative if program determined.
NumberResponseRecoveryThreads
Type: System.Int32
 Number of threads that response recovery can use. Positive if user specified, negative if program determined.
UseMemoryMappedFilesForResponseRecovery
Type: System.Int32
 Flag for using memory mapped files for response recovery.
-2 = Not using memory mapped files (Program Determined).
-1 = Not using memory mapped files (user specified).
1 = Using memory mapped files (user specified).
2 = Using memory mapped files (Program Determined).
ModelDifferencesOKWhenMergingResults
Type: System.Boolean
 Flag for merging results in presence of any model differences. True if results from two models that are not identical are OK to merge, false otherwise.
Return Value
Type: Int32
 Returns zero if the options are successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    Dim NumberDesignThreads As Integer
    Dim NumberResponseRecoveryThreads As Integer
    Dim UseMemoryMappedFilesForResponseRecovery As Integer
    Dim ModelDifferencesOKWhenMergingResults As Boolean
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
    ret = EtabsObject.ApplicationStart()
   'create SapModel object
    SapModel = EtabsObject.SapModel
   'initialize model
    ret = SapModel.InitializeNewModel()
   'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get model solver options
    ret = SapModel.Analyze.GetDesignResponseOption(NumberDesignThreads, NumberResponseRecoveryThreads, UseMemoryMappedFilesForResponseRecovery, ModelDifferencesOKWhenMergingResults)
   'close ETABS
    EtabsObject.ApplicationExit(False)
   'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace